{
  "news":[
	{
		"created_at": "Mon, 31 Jan 2022 12:35:55 GMT",
		"description": "New Delhi: Religare Finvest Ltd and three senior officials of Fortis Hospitals paid a total of over Rs 4.34 crore to markets regulator Sebi to settle a case related to the diversion of Fortis Healthcare's funds by its promoters and related entities. Those who have settled the proceedings are the independent directors of Fortis Hospitals -- Aditya Vij, Sandeep Puri and Balinder Singh Dhillon. Puri was also the chief financial officer of FHL and Dhillon was its non-independent director. \n\n An investigation was initiated by Sebi in the matter of Fortis Healthcare Ltd (FHL) after an article published in February 2018 said its promoters have taken at least Rs 500 crore out of FHL and that its statutory auditor had refused to sign off on the company's second-quarter results until the funds were accounted for. \n\n It was alleged that Religare Finvest was one of the conduit entities that had aided and abetted the routing of funds from FHL, ultimately to RHC Holdings, for the benefits of the promoter entities. \n\n The independent directors were alleged to have aided in the misuse and diversion of public shareholders' funds through three borrower companies for the benefit of RHC Holding and consequently, Malvinder Mohan Singh and Shivinder Mohan Singh. \n\n They had allegedly failed to carry out adequate due diligence and exercise independent judgment with respect to the grant of loans/ investments by Fortis Hospitals to the three borrower companies. \n\n Besides, Puri had issued a misleading CFO certificate in the annual reports of FHL during the investigation period which stated that \"the financials of FHL presented true and fair view of its affairs and not containing any misleading statement\". \n\n Pending the proceedings, the applicants filed settlement applications with Sebi proposing to settle the case without admitting or denying the guilt. \n\n Thereafter, in a meeting with Sebi's internal committee, they proposed to pay settlement charges of Rs 93.50 lakh each for Balinder Singh Dhillon and Sandeep Puri, Rs 65 lakh for Aditya Vij and Rs 1.82 crore for Religare Finvest. \n\n The respective amounts, after the high-powered advisory committee's recommendations and Sebi's whole-time members' approval, were remitted by them in January. \n\n \"It is hereby ordered that this settlement order disposes of the aforesaid adjudication proceedings initiated against the applicants viz. Aditya Vij, Sandeep Puri, Balinder Singh Dhillon and Religare Finvest Limited vide SCN (show-cause notice)...dated April 9, 2021,\" Sebi said.",
		"headline": "Religare Finvest, Fortis Hospital's officials pay over Rs 4.3 cr to settle case with Sebi",
		"id": 58,
		"image_url": "https://img.etimg.com/thumb/msid-89248840,width-210,imgsize-30494,,resizemode-4,quality-100/fortis-2-1.jpg",
		"is_deleted": false,
		"news_link": "https://economictimes.indiatimes.com/markets/stocks/news/religare-finvest-fortis-hospitals-officials-pay-over-rs-4-3-cr-to-settle-case-with-sebi/articleshow/89248791.cms",
		"publish_date": "Mon, 31 Jan 2022 17:52:00 GMT",
		"source": "The Economic Times",
		"updated_at": "Mon, 31 Jan 2022 12:35:55 GMT"
	},
	{
		"created_at": "Mon, 31 Jan 2022 12:36:01 GMT",
		"description": "New Delhi: Retail investors' interest in the Indian securities market has seen a significant uptick, as 2.21 crore individual demat accounts were added in April-November 2021, underpinned by the buoyancy in the stock market, according to the Economic Survey. \"With continuing buoyant trend in Indian stock markets, participation by individual investors in the equity cash segment has increased and the share of individual investors in total turnover at NSE increased from 38.8 per cent in 2019-20 to 44.7 per cent in April-October 2021,\" the Survey noted. \n\n The substantial increase in share of individual investors in 2020-21 and 2021-22 can partly be ascribed to the increase in new investor registrations witnessed since February 2020. \n\n In April-November 2021, nearly 221 lakh individual demat accounts were added, the Economic Survey for 2021-22 noted. \n\n Overall, the participation of retail investors in securities markets has seen a significant rise especially in the last two years, which is evident from the increase in the number of demat accounts. \n\n Market experts said that on an average, 4 lakh new demat accounts were opened every month in 2019-20, which increased to over 26 lakh per month in the current financial year. \n\n The higher participation could be attributed to buoyant stock markets. The benchmark stock market indices -- Sensex and Nifty -- surged by 17.7 per cent and 18.1 per cent, respectively during April-December 2021. \n\n In addition, the net Assets Under Management (AUM) of the mutual fund industry rose by 24.4 per cent to Rs 37.3 lakh crore at the end of November 2021, from Rs 30 lakh crore at the end of November 2020, the Survey showed. \n\n Further, net resource mobilization by mutual funds was at Rs 2.54 lakh crore during April-November 2021, as compared to Rs 2.73 lakh crore during the same period of the preceding year. \n\n During April-November 2021, foreign portfolio investors (FPIs) made a net investment of Rs 24,124 crore in Indian securities, 82.8 per cent lower than what was made in the same period of the previous year. \n\n As of November 2021, cumulative net investment by FPIs increased by 9.2 per cent to USD 288.4 billion from USD 264 billion at end November 2020.",
		"headline": "Retail participation in equity market rises on buoyant stock market: Eco Survey",
		"id": 59,
		"image_url": "https://img.etimg.com/thumb/msid-89247670,width-210,imgsize-619295,,resizemode-4,quality-100/retail-participation-in-equity-market-rises-on-buoyant-stock-market-eco-survey.jpg",
		"is_deleted": false,
		"news_link": "https://economictimes.indiatimes.com/markets/stocks/news/retail-participation-in-equity-market-rises-on-buoyant-stock-market-eco-survey/articleshow/89247633.cms",
		"publish_date": "Mon, 31 Jan 2022 17:13:00 GMT",
		"source": "The Economic Times",
		"updated_at": "Mon, 31 Jan 2022 12:36:01 GMT"
	},
	{
		"created_at": "Mon, 31 Jan 2022 09:22:56 GMT",
		"description": "NEW DELHI: The buoyant stock market has been accompanied by huge retail participation, so much so that about 221 lakh individual demat accounts were added in April-November 2021, this year’s Economic Survey suggested.\n\nAs per the survey, retail participation in NSE's cash segment stood at 44.7 per cent in April-October period, largely similar to 45 per cent in FY21 but much higher than 38.8 per cent in FY20.\n\n A substantial increase in share of individual investors in FY21 and FY22 can partly be ascribed to the increase in new investor registrations witnessed since February 2020, the survey said.\n\nETMarkets.comAnalysts have largely felt that the massive structural change in retail flows have mitigated the risk of outflows from the FPIs. They noted that retails flows were more pronounced in mid-and small-cap stocks in 2021 and suggested that retail ownership of small cap stocks, defined as aggregate ownership of bottom 667 stocks as a percentage of overall market cap, are at multi-year highs.\n\nThat of mid-cap ownership is also close to historical peaks. On the other hand, the retail ownership of large caps is still below the pre-pandemic levels, Nomura India said in a recent note.\n\nTo boost retail participation, market analysts are largely expecting the Finance Minister Nirmala Sitharaman to abolish the security transaction tax (STT) that replaced the long-term capital gains (LTCG) tax in 2004.\n\nBudget 2018 brought back LTCG, being levied at a rate of 10 per cent on annual gains of over Rs 1 lakh, but STT was not eliminated.\n\nNow, with many new investors flocking to equity markets in the last 12-18 months, a removal of STT could encourage investors to start trading, said William O'Neil India in a note.\n\nSo far, STT on non-delivery transactions is 0.025 per cent and for delivery is 0.1 per cent.\n\nAlthough investors want LTCG to be removed, the government, in the winter session of parliament, said there are no plans to abolish LTCG tax on equities and mutual funds. \n\n\"While there are hopes that Budget 2022 would see STT removed, it is estimated that with increasing investors and trade volumes in the market, STT could generate more than Rs 5,000 crore in revenue. LTCG collection for AY 2019-20 and AY 2020-21 was Rs 3,460 crore and Rs 5,311 crore, respectively. Looking at those numbers, it is unlikely the government would make a change here,\" William O'Neil India said in a note.\n\nThe survey suggested that the Indian economy stands guard with an added advantage of plenty of policy room for maneuvering as the process of normalisation of monetary policy by systematically important central banks takes hold.\n\nAdvance estimates suggest that the Indian economy is expected to witness real GDP expansion of 9.2 per cent in 2021-22 after contracting in 2020-21.\n\nThe survey noted that India’s capital markets, like many global markets, have done exceptionally well and have allowed record mobilisation of risk capital for Indian companies.\n\nThe economic revival has mostly been financed through money raised through the capital markets rather than bank credit, the survey pointed out.\n\n\"Risk capital (i.e. money raised from capital markets) has so far been more important than the banks in providing finance to the revival,\" it stated.",
		"headline": "Retail participation in stock market strong: Economic Survey",
		"id": 27,
		"image_url": "https://img.etimg.com/thumb/msid-89242381,width-210,imgsize-50768,,resizemode-4,quality-100/eco-survey.jpg",
		"is_deleted": false,
		"news_link": "https://economictimes.indiatimes.com/markets/stocks/news/retail-participation-in-stock-market-strong-economic-survey/articleshow/89242418.cms",
		"publish_date": "Mon, 31 Jan 2022 14:51:00 GMT",
		"source": "The Economic Times",
		"updated_at": "Mon, 31 Jan 2022 09:22:56 GMT"
	},
	{
		"created_at": "Mon, 31 Jan 2022 09:22:51 GMT",
		"description": "A large section of investors in India believes that the process of generating consistent investment returns stops at finding a great company. The belief goes: “If you find a company that keeps growing (revenues and profits) and generates strong free cash flows, its share price will keep appreciating. So, one should focus all energy on finding a great business and keep investing in such businesses. That is the key — and to some, the only way — to generate superior long-term returns.” \n\nToday, I intend to debunk this hypothesis. In fact, I counter by saying: “A great company is a great investment only when you pay the right price for it.” \n\nLet us take the case of one of the largest beverage companies in the world, a true legend in its area of operations. It is the second-largest holding at Berkshire Hathaway. All of us have consumed some of its products at some point in our lives — the Coca-Cola Co (KO for short, going by the stock symbol).\n\nWarren Buffet first invested in this business in 1988, buying 4.2 per cent of the company. In 1989, he bought another 2.8 per cent and topped it up with another 0.6 per cent in 1994. In total, Berkshire invested $1.3 billion for a 7.6 per cent stake, which has since increased to 9.3 per cent after several rounds of buyback. All said, its $1.3-billion investment has turned into a whopping $24 billion. That is a return of 18.5 times to date. \n\nDuring the same time, KO’s revenues have grown from $7.7 billion to $38 billion, profits from $0.9 billion to over $10 billion and free cash flows from $0.9 billion to $12 billion. That is truly spectacular.\n\nThe devil, however, as they say, is in the details. See the chart below, where we break down the share price performance of KO in three cycles.\n\n\nETMarkets.com\n\nCycle One - The Exuberance (1988 to 1998): A vast majority of Berkshire’s purchase was done by 1989 when KO’s revenue was $7-8 billion, and profits $1 billion. KO traded at 15 times profits and 20 times free cash flow back then. By 1997, KO’s revenues would grow by 1.5 times, and its net income and free cash flow would go on to rise by 2.9 and 2.8 times, respectively. KO’s market cap, however, rose by a staggering 10.6 times (or at 25 per cent CAGR). By 1997, when KO’s market cap had risen to $165 billion, the value of Berkshire’s holding had risen to $13 billion. Price to earnings multiple had now ballooned to 50 times. \n\nBack then, the annual reports used to start the “message to shareholders” with an update on share price performance. And what do you reckon was the company’s unique asset? “The world’s most powerful trademark.” Yes, it wasn’t a beverage or foods company; it owned the most powerful trademark. One with a distribution network so strong that later, when it was late to the packaged drinking water game, it could just pressure the network to accommodate that product too and come out on top.\n\n\nCycle Two – What the Heck is the Market Thinking (1998 to 2008): During this decade, KO’s revenues grew 69 per cent, net income grew 64 per cent and the free cash flow a staggering 2.2 times. Having aggressively invested in the previous cycle, KO had started seeing the benefits and was generating the highest free cash flows of its lifetime. \n\nThe 2008 annual review started with the tagline Buy.Drink.Smile, and no reference to share price performance. Coca-Cola Zero, launched in 2005, was now the most successful product launch since Diet Coke launched in 1982, and Coca-Cola continued to be one of the greatest brands, with 12 other billion-dollar brands in its kitty. KO was also ranked No. 1 and 2 (globally) in ready-to-drink coffees and tea and sports drinks. It has truly come a long way.\n\nThe market, however, was not impressed. In this cycle, the market cap of KO fell by 37 per cent and price-to-earnings multiples contracted from close to 50 times to under 20 times. Yes, the company had done great during the last decade, but it appeared like all was priced in.\n\n\nCycle Three – Yeah Okay, Lesson Learned (2008 to now): Since the end of the global financial crises, KO’s revenues have risen close to 18 per cent, but net income margins have expanded, resulting in a 75 per cent increase in net income. It does not need to aggressively invest anymore, resulting in free cash flows of over two times. During this time, KO’s market cap has risen at 7 per cent CAGR, and earnings multiples have expanded to 25 times.\n\nPut another way, had you invested at the peak of 1998 (assuming that a good company is a great investment at all points in time), you would have had to wait close to 15 years for the investment to break even. During those 15 years, you would have witnessed KO more than doubling revenues and close to tripling earnings, but your investments would have gone nowhere.\n\nIt was simply the case of too much investor exuberance resulting in elevated multiples during 1998, which normalised during the next decade. KO was always a great company, but not always a great investment across cycles. \n\nAnd if you think I am challenging the wisdom of the great Sage of Omaha, let me assure you that I am not. Consider this: Since 1994, Berkshire has generated billions of dollars in investible surplus, but it has chosen not to invest any of it in KO. For Berkshire, KO was a good enough company to not sell, but it was not a good investment at any time after 1994. If anything, Berkshire’s actions present an argument in favour of my hypothesis, and not against it.\n\n(The author, Jigar Mistry is co-founder of Buoyant Capital. Views are his own.)",
		"headline": "A good business and a good investment are two different things",
		"id": 26,
		"image_url": "https://img.etimg.com/thumb/msid-89242909,width-210,imgsize-36302,,resizemode-4,quality-100/stock-market-4-getty.jpg",
		"is_deleted": false,
		"news_link": "https://economictimes.indiatimes.com/markets/stocks/news/a-good-business-and-a-good-investment-are-two-different-things/articleshow/89242811.cms",
		"publish_date": "Mon, 31 Jan 2022 14:29:00 GMT",
		"source": "The Economic Times",
		"updated_at": "Mon, 31 Jan 2022 09:22:51 GMT"
	},
	{
		"created_at": "Mon, 31 Jan 2022 09:24:19 GMT",
		"description": "The Indian economy is likely to grow at 9.2 per cent in 2021-22 (April-March), the Economic Survey for the current financial year said, adding that the level of real economic output would surpass the pre-COVID level of FY20.\n\n“The Indian economy, as seen in quarterly estimates of the gross domestic product (GDP), has been staging a sustained recovery since the second half of 2020-21. Although the second wave of the pandemic in April-June 2021 was more severe from a health perspective, the economic impact was muted compared to the national lockdown of the previous year,” the survey said.\n\nThe survey, tabled in parliament on Monday, said that it was essential to look at progress in vaccination as it was not just a health response, but also a buffer against economic disruptions caused by various waves of the pandemic. \n\nAccording to the survey, the services sector, which was the worst struck by the restrictions imposed to curb the spread of the virus, is estimated to grow by 8.2 per cent in the current fiscal year. \n\n“However, segments like travel, trade and hotels are yet to fully recover. It should be added that the stop-start nature of repeated pandemic waves makes it especially difficult for these sub-sectors to gather momentum,” the survey said. The services sector accounts for more than half of the Indian economy.\n\nThe agricultural sector, which was the least impacted by pandemic-related disruptions, is estimated to grow at 3.9 per cent in the current financial year on top of 3.6 per cent and 4.3 per cent, respectively, over the past two years, the survey said, adding that the sector now accounts for 18.8 per cent of the gross value added (GVA). \n\nThe survey pegged the share of the industrial sector in GVA at 28.2 per cent for the current year. \n\n“In contrast to the steady performance of the primary sector, the industrial sector went through a big swing by first contracting by 7 per cent in 2020-21 and then expanding by 11.8 per cent in this financial year,” the survey said.\n\n\nINVESTMENT\nThe survey pegged investment growth as measured by Gross Fixed Capital Formation at a hefty 15 per cent in the current financial year, adding that India’s investment is seen achieving a full recovery to pre-pandemic levels\n\nInvestment to GDP ratio has jumped around 29.6 per cent in the current year, registering the highest growth in seven years, driven by the government’s policy push on speeding up a virtuous cycle of growth through capital expenditure and infrastructure spending, the survey said.\n\n“While private investment recovery is still at a nascent stage, there are many signals which indicate that India is poised for stronger investment. The number of private investment projects under implementation in manufacturing sector has been rising over the years.”\n\nThe survey noted that record profits reported by companies in recent quarters and the mobilsation of risk capital warrants optimism for acceleration in private investment.\n\nKey factors here are a sturdy and cleaned-up banking sector which can support private investment and an expected increase in private consumption levels which could boost capacity utilisation and hence stoke private investment activity, the survey said.\n\n“RBI’s latest Industrial Outlook Survey results indicate rising optimism of investors and expansion in production in the upcoming quarters.”",
		"headline": "Economic Survey pegs India’s GDP growth at 9.2% in FY22; says vaccine progress essential",
		"id": 33,
		"image_url": "https://img.etimg.com/thumb/msid-89241719,width-210,imgsize-28136,,resizemode-4,quality-100/gdp.jpg",
		"is_deleted": false,
		"news_link": "https://economictimes.indiatimes.com/markets/stocks/news/economic-survey-pegs-indias-gdp-growth-at-9-2-in-fy22/articleshow/89241715.cms",
		"publish_date": "Mon, 31 Jan 2022 14:10:00 GMT",
		"source": "The Economic Times",
		"updated_at": "Mon, 31 Jan 2022 09:24:19 GMT"
	},
	{
		"created_at": "Mon, 31 Jan 2022 09:24:03 GMT",
		"description": "European shares rose on Monday, rebounding from their worst week in more than two months, as investors looked forward to the UK and European central bank meetings amid worries over policy tightening, soaring inflation and geopolitical tensions.\n\n The pan-European STOXX 600 added 0.9%, with tech stocks climbing 2% after dropping 13% so far this month.\n\n Vodafone gained 2.8% after saying it would work with Intel and other silicon vendors on designing its own chip architecture to drive innovation and efficiency in nascent OpenRAN network technology.\n\n The largest telecom provider in the Netherlands, KPN , added 1.1% after announcing a new share buyback programme and a higher dividend over 2022, as its core profit rose on the back of growing mobile revenues.\n\n Ryanair dropped 1.1% after posting a loss of 96 million euros ($107 million) for the final three months of 2021, with Chief Executive Officer Michael O'Leary saying the outlook remained hugely uncertain.\n\n Italian energy services group Saipem plunged 27% after issuing a profit warning and withdrawing an outlook given in October, citing a deterioration in margins due to the pandemic and higher raw material costs.",
		"headline": "European shares advance ahead of central bank meetings",
		"id": 30,
		"image_url": "https://img.etimg.com/thumb/msid-89242438,width-210,imgsize-140059,,resizemode-4,quality-100/european-shares.jpg",
		"is_deleted": false,
		"news_link": "https://economictimes.indiatimes.com/markets/stocks/news/european-shares-advance-ahead-of-central-bank-meetings/articleshow/89242425.cms",
		"publish_date": "Mon, 31 Jan 2022 14:09:00 GMT",
		"source": "The Economic Times",
		"updated_at": "Mon, 31 Jan 2022 09:24:03 GMT"
	},
	{
		"created_at": "Mon, 31 Jan 2022 09:24:08 GMT",
		"description": "Australian shares fell on Monday, as a rally in technology stocks failed to offset losses among banking and mining heavyweights, while investors cautiously await cues from the central bank's monetary policy meeting expected this week.\n\n The S&P/ASX 200 index closed 0.24% lower at 6,971.6, after losing as much as 0.8% earlier in the session. The benchmark ended 2.2% higher on Friday.\n\n The banking index lost 1.8%, with the country's four largest lenders losing between 1.6% and 3.4%, ahead of Reserve Bank of Australia (RBA) meeting on Tuesday.\n\n \"We might see QE wrap up in March and the rate rises kick off in June,\" said Henry Jennings, a senior analyst and portfolio manager, Marcustoday Financial Newsletter.\n\n Rate hikes might get complicated by Australia's upcoming federal elections in May, and which might move the RBA to talk about hikes but not make any policy decisions, Jennings said.\n\n A Reuters poll showed that market participants expect the RBA to end bond-buying programme on Tuesday, but wait until November to raise interest rates.\n\n Miners also retreated 0.6%, weighed down by BHP Group's 1.2% slump on the day its corporate unification with its London-listed entity became effective. Several brokerages also expect this to result in BHP's weightage on the banchmark index to rise to more than 10%.\n\n Rio Tinto lost 1.9%, while Fortescue added 2.2%.\n\n The technology sector saw a 3.7% gain, tracking a strong finish on Friday in Wall Street's Nasdaq index, as investors took advantage of cheap tech stocks following last week's selloff.\n\n Medical glove maker Ansell Ltd plunged 14.3% to its lowest level since March 2020 after the company slashed its full-year EPS outlook on supply chain disruptions.\n\n Meanwhile, Irongate Group surged 17.5% to a record high after the real-estate investor received a A$1.29 billion ($905.06 million) takeover bid from a partnership managed by property investor Charter Hall Group.\n\n New Zealand's benchmark S&P/NZX 50 index climbed 0.31% to 11,889.4.",
		"headline": "Banks, miners weigh on Australia shares ahead of RBA meeting",
		"id": 31,
		"image_url": "https://img.etimg.com/thumb/msid-89242375,width-210,imgsize-418624,,resizemode-4,quality-100/australian-shares.jpg",
		"is_deleted": false,
		"news_link": "https://economictimes.indiatimes.com/markets/stocks/news/banks-miners-weigh-on-australia-shares-ahead-of-rba-meeting/articleshow/89242365.cms",
		"publish_date": "Mon, 31 Jan 2022 14:07:00 GMT",
		"source": "The Economic Times",
		"updated_at": "Mon, 31 Jan 2022 09:24:08 GMT"
	},
	{
		"created_at": "Mon, 31 Jan 2022 09:24:14 GMT",
		"description": "TOKYO - Japan's Nikkei share average extended its tech-driven rally in afternoon trade after the country's premier said he is not currently considering issuing a new state of emergency.\n\n Chipmakers, Sony and start-up investor SoftBank Group helped lift the benchmark index following a strong performance by their Wall Street peers at the end of last week.\n\n The Nikkei ended the day 1.07% higher at 27,001.98, with technology the best-performing sector, jumping 2.35%.\n\n The broader Topix rose 1.01%. The Topix growth share index leapt 1.70%, compared with a 0.39% advance for the value index.\n\n \"Today's market is rising just like the spring is stretching back, supported by the rebound on Wall Street last week,\" said Chihiro Ohta at the investment research and investor services at SMBC Nikko Securities.\n\n \"The market's direction this week will depend on the upcoming U.S. economic data and corporate earnings.\"\n\n Chip-making giant Tokyo Electron added 3.32% and was the biggest riser on the Nikkei by index points. Rivals Advantest and Renesas gained 4.36% and 5.19%, respectively.\n\n Staffing agency Recruit Holdings, which is seen as a technology stock for its holdings in the U.S. online job search Indeed, jumped 5.47%.\n\n SoftBank Group advanced 4.5% and Sony Group added 3.96%.\n\n Alps Alpine surged 17.36% and was the top percentage gainer on the Nikkei, after the maker of car navigation systems raised its annual operating profit forecast.\n\n Mitsui OSK Lines led shippers higher with a 9.59% jump after reporting earnings.\n\n At the other end, Omron tumbled 7% after the healthcare equipment maker cut its annual operating profit outlook.\n\n Chubu Electric Power, down 8.36%, was the biggest loser on the Nikkei, while Tokyo Electric Power Company Holdings Inc shed 5.26%.",
		"headline": "Nikkei extends gains after Japan premier says he is not considering lockdowns",
		"id": 32,
		"image_url": "https://img.etimg.com/thumb/msid-89242330,width-210,imgsize-25867,,resizemode-4,quality-100/nikkei.jpg",
		"is_deleted": false,
		"news_link": "https://economictimes.indiatimes.com/markets/stocks/news/nikkei-extends-gains-after-japan-premier-says-he-is-not-considering-lockdowns/articleshow/89242305.cms",
		"publish_date": "Mon, 31 Jan 2022 14:05:00 GMT",
		"source": "The Economic Times",
		"updated_at": "Mon, 31 Jan 2022 09:24:14 GMT"
	},
	{
		"created_at": "Mon, 31 Jan 2022 09:20:20 GMT",
		"description": "ICICI Direct's research report on Ramco CementsRamco Cements is the dominant player in South India with cement capacity of 19.4 MT spread across Tamil Nadu, Andhra Pradesh, Odisha and West Bengal. In terms of sales, South contributes ~71% of sales while East contribute 24%, which is served via grinding units in WB (2 MT) and AP (2 MT). The company also has windmill capacity of 166 MW, captive thermal power plants of 175 MW and 18 MW of WHRS • Self-reliance on power, split grinding units near markets and focus on green power has helped the company to remain a cost efficient player in South India.OutlookPost completion of major capex, debt levels would peak out while growth to accelerate with revenue CAGR of 17.2%. Hence, maintain BUY rating. We value Ramco at Rs 1,130 i.e.17x FY23E EV/EBITDA.For all recommendations report, click hereDisclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.Read More",
		"headline": "Buy Ramco Cements; target of Rs 1130: ICICI Direct",
		"id": 8,
		"image_url": "https://images.moneycontrol.com/static-mcnews/2020/11/Buy_1-770x433.jpg?impolicy=website&width=770&height=431",
		"is_deleted": false,
		"news_link": "https://www.moneycontrol.com/news/business/stocks/buy-ramco-cements-target-of-rs-1130-icici-direct-8000441.html",
		"publish_date": "Mon, 31 Jan 2022 12:42:00 GMT",
		"source": "MoneyControl",
		"updated_at": "Mon, 31 Jan 2022 09:20:20 GMT"
	},
	{
		"created_at": "Mon, 31 Jan 2022 09:20:26 GMT",
		"description": "ICICI Direct's research report on Supreme IndustriesSupreme Industries (SIL) is India’s leading plastic processing company with a presence in four major segments including piping systems, packaging products, industrial products & consumer product category with revenue contribution of 63%,18%, 12% & 7%, respectively. Market leader in the PVC pipe industry with a value market share of 14% • Robust balance sheet with RoE & RoCE of 24% & 27% (five-year average), respectively, with stringent working capital policy.OutlookWe maintain our BUY rating on the stock. We roll over our valuation on FY24E and value the stock at 28x P/E FY24E EPS with a revised target price of Rs 2625.More Info on TrentAt 17:30 Supreme Industries was quoting at Rs 2,088.10, up Rs 30.85, or 1.50 percent.It has touched an intraday high of Rs 2,139.20 and an intraday low of Rs 2,066.25.It was trading with volumes of 3,379 shares, compared to its thirty day average of 4,622 shares, a decrease of -26.89 percent.In the previous trading session, the share closed up 0.27 percent or Rs 5.50 at Rs 2,057.25.The share touched its 52-week high Rs 2,689.00 and 52-week low Rs 1,754.00 on 19 October, 2021 and 29 January, 2021, respectively.Currently, it is trading 22.35 percent below its 52-week high and 19.05 percent above its 52-week low.Market capitalisation stands at Rs 26,524.48 crore.For all recommendations report, click hereDisclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.Read More",
		"headline": "Buy Supreme Industries; target of Rs 2625: ICICI Direct",
		"id": 9,
		"image_url": "https://images.moneycontrol.com/static-mcnews/2020/11/buy-2-1-770x433.jpg?impolicy=website&width=770&height=431",
		"is_deleted": false,
		"news_link": "https://www.moneycontrol.com/news/business/stocks/buy-supreme-industries-target-of-rs-2625-icici-direct-8000411.html",
		"publish_date": "Mon, 31 Jan 2022 12:41:00 GMT",
		"source": "MoneyControl",
		"updated_at": "Mon, 31 Jan 2022 09:20:26 GMT"
	}
]
}